//==============================================================================
// 事件: ue_delfl::u_bf_zd_bfjsbz()
//------------------------------------------------------------------------------
// 描述: 
//------------------------------------------------------------------------------
// 参数:(无)
//------------------------------------------------------------------------------
// 返回值:  
//------------------------------------------------------------------------------
// 作者:	yangxx		日期: 2010.06.11
//------------------------------------------------------------------------------
// 修改历史: 
//	
//------------------------------------------------------------------------------
// PS10.0
//==============================================================================


Long vlrow
Long vlused
string vsglyxbh
string vsflbh
vlrow = dw_3.getrow()

if vlrow < 1 then return 

// 判断工序是否可以删除
vsglyxbh = dw_3.GetItemString(vlrow,'CMBZGYLX_GYLXBH')
vsflbh   = dw_3.GetItemString(vlrow,'CMBZGYLX_FLBH')

SELECT COUNT(1) INTO :vlused FROM CMCJSCRWGY
	WHERE CMCJSCRWGY_GYLXBH = :vsglyxbh AND CMCJSCRWGY_GYLXFLBH = :vsflbh;

if vlused < 1 then
    dw_3.deleterow(vlrow)
else 
    messagebox('提示信息','该条工艺路线已投入使用，不可删除')
end if



RETURN 